In [37]:
import numpy as np
import pandas as pd

In [38]:
#Merging 2 dataframes

In [39]:
employees = pd.DataFrame({
       'employee_id': [1,2,3,4,5],
        'Name':['shivam','sujeet','rich','khemraj','vineeta'],
        'Department':['data science','Trader','money','job','house wife']
})

Salary = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [40]:
employees

   employee_id     Name    Department
0            1   shivam  data science
1            2   sujeet        Trader
2            3     rich         money
3            4  khemraj           job
4            5  vineeta    house wife

In [41]:
Salary

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [42]:
pd.merge(employees,Salary,on='employee_id',how ='inner')

   employee_id    Name    Department  salary  bonus
0            1  shivam  data science   60000   5000
1            2  sujeet        Trader   80000  10000
2            3    rich         money   65000   7000

In [43]:
pd.merge(employees,Salary,on='employee_id',how='outer')

   employee_id     Name    Department   salary    bonus
0            1   shivam  data science  60000.0   5000.0
1            2   sujeet        Trader  80000.0  10000.0
2            3     rich         money  65000.0   7000.0
3            4  khemraj           job      NaN      NaN
4            5  vineeta    house wife      NaN      NaN
5            6      NaN           NaN  70000.0   8000.0
6            7      NaN           NaN  90000.0  12000.0

In [44]:
pd.merge(employees,Salary,on='employee_id',how='left')

   employee_id     Name    Department   salary    bonus
0            1   shivam  data science  60000.0   5000.0
1            2   sujeet        Trader  80000.0  10000.0
2            3     rich         money  65000.0   7000.0
3            4  khemraj           job      NaN      NaN
4            5  vineeta    house wife      NaN      NaN

In [45]:
pd.merge(employees,Salary,on='employee_id',how='right')

   employee_id    Name    Department  salary  bonus
0            1  shivam  data science   60000   5000
1            2  sujeet        Trader   80000  10000
2            3    rich         money   65000   7000
3            6     NaN           NaN   70000   8000
4            7     NaN           NaN   90000  12000

In [46]:
#Concatination of 2 dataframes

In [50]:
sh = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

sh1 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [51]:
sh

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [52]:
sh1

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [53]:
pd.concat([sh,sh1])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [54]:
pd.concat([sh1,sh])

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [61]:
pd.concat([sh1,sh],axis= 1)

    A   B   C   A   B   C
0  A3  B3  C3  A0  B0  C0
1  A4  B4  C4  A1  B1  C1
2  A5  B5  C5  A2  B2  C2

In [62]:
sh

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [63]:
pd.concat([sh,sh1])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
#Joining 2 data frames

In [69]:
sh3 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
sh2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [70]:
sh3

      name
1    Alice
2      Bob
3  Charlie

In [67]:
sh2

   score
2     85
3     90
4     75

In [72]:
sh3.join(sh2,how='outer')

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [73]:
sh2.join(sh3)

   score     name
2     85      Bob
3     90  Charlie
4     75      NaN